Repository: govuk-one-login/mobile-ios-one-login-app
Catalog: Sources/Resources/Localizable.xcstrings
Source language: en
Languages: cy_gb

# app_closeButton
source: Close
cy_gb: Cau

# app_continueButton
source: Continue
cy_gb: Parhau

# app_enableFaceIDBody
source: Add a layer of security and sign in with your face instead of your email address and password. Your Face ID is not shared with GOV.UK One Login. If you do not want to use Face ID, you can sign in with your phone passcode instead.
cy_gb: Ychwanegwch haen o ddiogelwch a mewngofnodi gyda'ch wyneb neu olion bysedd yn hytrach na'ch cyfeiriad e-bost a chyfrinair. Nid yw eich biometreg yn cael ei rannu â GOV.UK One Login. Os nad ydych am ddefnyddio biometreg, gallwch fewngofnodi gyda'ch cod mynediad neu batrwm ffôn yn lle hynny.

# app_enableFaceIDButton
source: Use Face ID
cy_gb: Defnyddip ID Wyneb

# app_enableFaceIDFootnote
source: If you use Face ID, anyone with a Face ID saved to your phone will be able to sign in to this app.
cy_gb: Os ydych yn defnyddio ID Wyneb, bydd unrhyw un sydd â ID Wyneb wedi'i arbed ar eich ffôn yn gallu mewngofnodi i'r ap hwn.

# app_enableFaceIDTitle
source: Use Face ID to sign in
cy_gb: Defnyddiwch ID Wyneb i fewngofnodi

# app_enablePasscodeButton
source: Use passcode
cy_gb: Defnyddio god mynediad

# app_enableTouchIDBody
source: Add a layer of security and sign in with your face instead of your email address and password. Your Touch ID is not shared with GOV.UK One Login. If you do not want to use Touch ID, you can sign in with your phone passcode instead.
cy_gb: Ychwanegwch haen o ddiogelwch a mewngofnodi gyda'ch wyneb yn hytrach na'ch cyfeiriad e-bost a cyfrinair. Nid yw eich ID Cyffwrdd yn cael ei rannu â GOV.UK One Login. Os nad ydych am ddefnyddio ID Cyffwrdd, gallwch fewngofnodi gyda'ch cod mynediad eich ffôn yn lle hynny.

# app_enableTouchIDEnableButton
source: Use Touch ID
cy_gb: Defnyddio ID Cyffwrdd

# app_enableTouchIDFootnote
source: If you use Touch ID, anyone with a Touch ID saved to your phone will be able to sign in to this app.
cy_gb: Os ydych yn defnyddio ID Cyffwrdd, bydd unrhyw un sydd â ID Cyffwrdd wedi'i arbed ar eich ffôn yn gallu mewngofnodi i'r ap hwn.

# app_enableTouchIDTitle
source: Use Touch ID to sign in
cy_gb: Defnyddiwch ID Cyffwrdd i fewngofnodi

# app_networkErrorBody
source: GOV.UK One Login is not available offline. Reconnect to the internet and try again.
cy_gb: Nid yw GOV.UK One Login ar gael os nad ydych ar-lein. Ailgysylltwch â'r rhyngrwyd a rhoi cynnig arall.

# app_networkErrorTitle
source: You appear to be offline
cy_gb: Mae'n ymddangos nad ydych ar-lein

# app_noPasscodeSetupBody
source: Setting a passcode on your phone adds further security. You can then sign into the app this way instead of with your email address and password. You can set a passcode later by going to your phone settings.
cy_gb: Mae gosod cod mynediad ar eich ffôn yn ychwanegu mwy o ddiogelwch. Yna gallwch fewngofnodi i'r ap y ffordd hyn yn hytrach na gyda'ch cyfeiriad e-bost a'ch cyfrinair. Gallwch osod cod mynediad yn nes ymlaen trwy fynd i'ch gosodiadau ffôn.

# app_noPasscodeSetupTitle
source: It looks like this phone does not have a passcode
cy_gb: Mae'n edrych fel nad oes gan y ffôn hwn god mynediad

# app_signInBody
source: Sign in with the email address you use for your GOV.UK One Login.
cy_gb: Mewngofnodwch gyda'r cyfeiriad e-bost rydych yn ei ddefnyddio ar gyfer eich GOV.UK One Login.

# app_signInButton
source: Sign in
cy_gb: Mewngofnodi

# app_signInErrorBody
source: You can try signing in again. If this does not work, you may need to try again later.
cy_gb: Gallwch geisio mewngofnodi eto. Os na fydd hyn yn gweithio, efallai y bydd angen i chi roi cynnig arall yn nes ymlaen.

# app_signInErrorTitle
source: There was a problem signing you in
cy_gb: Roedd problem wrth eich mewngofnodi

# app_somethingWentWrongErrorBody
source: Try again later.
cy_gb: Rhowch gynnig arall yn nes ymlaen.

# app_somethingWentWrongErrorTitle
source: Something went wrong
cy_gb: Aeth rhywbeth o'i le

# app_tryAgainButton
source: Try again
cy_gb: Rhowch gynnig arall
